HOCOOH/STM32-Authentication/Src/main.c
    // printf("\n\r");
    // printf("\n\r===================================\n\r");
    printf("\n\r FS-STM32Éí·ÝÑéÖ¤ÏµÍ³\n\r");
    // printf("\n\r test : len(pass_store):%d\n\r", len(pass_store));
    // printf("\n\r test : pass_store:\n\r");
    // disp_in_serial(pass_store);
    
    // SM3_Hash(pass_store, len(pass_store), (void*)pass_store_sm3);
    // printf("SM3¹þÏ£ºóµÄpass_store:\n\r");
    // disp_in_serial(pass_store_sm3);
    // printf("\n\r");

    // Ö÷Ñ­»·
    while (1) {
        /* ³õÊ¼»¯×´Ì¬ */
        if (state.currentState == STATE_INIT) {
						
            /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
            HAL_Init();

            /* Configure the system clock */
            SystemClock_Config();

            /* Initialize all configured peripherals */
            MX_GPIO_Init();
            MX_I2C1_Init();
            MX_USART1_UART_Init();
            //MX_CRC_Init();
					
					
						// write pass_store from flash
						
						//STMFLASH_Write(PASS_STORE_ADDR, pass_test, MAX_PASSWORD_LEN);
						//u32 pass_read_test[MAX_PASSWORD_LEN  + 1];
						//STMFLASH_Read(PASS_STORE_ADDR, pass_read_test, MAX_PASSWORD_LEN);
						//printf("After read!\n");
						//printf("%x %x %x %x\n",pass_read_test[0], pass_read_test[1], pass_read_test[2],pass_read_test[3]);
						
					
            /* Initialize variables */
            refreshCount = REFRESH_COUNT_INIT;
            input_cursor = 0;
						edit_mode = 0;
            for (int i = 0; i < MAX_PASSWORD_LEN; i++) {
                pass_buf[i] = 0;
            }
            
            rand_delay();
            SM3_Hash(pass_store, len(pass_store), (void*)pass_store_sm3);
            UpdatePasswdBackup();

            // switch to state wait
            UpdateState(STATE_WAIT);
        }
        /* ´ý»ú×´Ì¬ */
        else if (state.currentState == STATE_WAIT) {
            rand_delay();
            if (IsStateValid(STATE_WAIT)) {
                state.errorCode = EXCEPT_UNVALIAD_STATE;
                UpdateState(STATE_EXCEPTION);
                continue;
            }
            input_cursor = 0;
            /* ¼ì²âµ½ÊäÈë£¬×ªµ½ÊäÈë×´Ì¬ */
            if (flagInterrupt == 1) {
                UpdateState(STATE_INPUT);
                continue;
            }
            // set refresh timer 
            if (refreshCount-- == 0) {
                //UpdateState(STATE_INIT);
                //continue;
            }
        }
        /* ÊäÈë×´Ì¬ */
        else if (state.currentState == STATE_INPUT) {
            rand_delay();
            if (IsStateValid(STATE_INPUT)) {
                state.errorCode = EXCEPT_UNVALIAD_STATE;
                UpdateState(STATE_EXCEPTION);
                continue;
            }
						
						time_count = 0;
            // get input 
            while (input_cursor < MAX_PASSWORD_LEN) {
							
								if (time_count > 5000000 * TIMEOUT_THRESHOLD) {
									time_count = 0;
									state.errorCode = EXCEPT_TIMEOUT;
                  UpdateState(STATE_EXCEPTION); // return wait state 
									goto expcetion_handler;
								}
								
                if(flagInterrupt == 1) {
                    flagInterrupt = 0;
                    I2C_ZLG7290_Read(&hi2c1,0x71,0x01,Rx1_Buffer,1);	//¶Á¼üÖµ
                    swtich_key();	//É¨Ãè¼üÖµ£¬Ð´±êÖ¾Î»
                    I2C_ZLG7290_Read(&hi2c1,0x71,0x10,Rx2_Buffer,8);	//¶Á8Î»ÊýÂë¹Ü
                    switch_flag();	//É¨Ãèµ½ÏàÓ¦µÄ°´¼ü²¢ÇÒÏòÊýÂë¹ÜÐ´½øÊýÖµ
                    printf("flag: %d\n\r", flag);

                    if (flag == 14) {// #
                        printf("Password input done!\n\r");
                        hashMark = 0;
                        break;
                    }
                    else if (flag == 16 && hashMark == 0) { // *
                        printf("Edit password\n\r");
                        hashMark = 1;
                        break;
                    }
                    else {
                        pass_buf[input_cursor++] = flag;
                    }
										time_count = 0;
              // todo: Òì³£!!!:ÎÞÐ§µÄ×Ö·
									}
								time_count++;
							}
            
						pass_buf[input_cursor] = 0;
            // Òì³£: ÃÜÂë³¤¶È¹ý³¤
            if (input_cursor >= MAX_PASSWORD_LEN) {
                printf("Password is too long\n\r");
                state.errorCode = EXCEPT_PASSLEN_LONG;
                UpdateState(STATE_EXCEPTION);
                continue;
            }
            // Òì³£: ÃÜÂë³¤¶È¹ý¶Ì
            else if (input_cursor < MIN_PASSWORD_LEN) {
                printf("Password is too short\n\r");
                state.errorCode = EXCEPT_PASSLEN_SHORT;
                UpdateState(STATE_EXCEPTION);
                continue;
            }
            // todo: ÖØ¸´ÊäÈë**********************
						IsStateValid(STATE_INPUT);
						printf("editmode:%d\n", edit_mode);
            /* ÊäÈëºÏ·¨ */
            if (edit_mode == 1) {
                UpdateState(STATE_EDIT);
            }
            else {
								printf("test!!!!\n");
								IsStateValid(STATE_INPUT);
								UpdateState(STATE_CHECK);
								IsStateValid(STATE_INPUT);
            }

        }
        /* ÅÐ¶ÏÃÜÂë×´Ì¬ */
        else if (state.currentState == STATE_CHECK) {
            rand_delay();
            if (IsStateValid(STATE_CHECK)) {
                state.errorCode = EXCEPT_UNVALIAD_STATE;
                UpdateState(STATE_EXCEPTION);
                continue;
            }
            // printf("\n\rlen: %d  ", input_cursor);
            // printf("pass_buf:\n\r");
            // disp_in_serial(pass_buf);
            /* ¶ÔÊäÈëµÄÃÜÂë½øÐÐSM3ÕªÒª */
            SM3_Hash(pass_buf, len(pass_buf), (void*)pass_buf_sm3);
            printf("SM3 hash value of pass_buf: ");
            disp_in_serial(pass_buf_sm3);
            printf("SM3 hash value of pass_store: ");
            disp_in_serial(pass_store_sm3);
            
            /* ±È¶ÔÊäÈëÕªÒªºÍÕæÊµÃÜÂëÕªÒª */
            if (IsPasswdValid()) {
                printf("´æ´¢µÄÃÜÂëËð»µÇÒÎÞ·¨»Ö¸´\n\r");
                while (1) {}
            }
            int cmp_res = cmp(pass_buf_sm3, pass_store_sm3, input_cursor);
            if (cmp_res == 0) { // Æ¥Åä
                // ÏÔÊ¾success
                printf("password match!\n\r");
                uint8_t success_code[] = {0xB6, 0xB6, 0x9E, 0x9C, 0x9C, 0x7C, 0xB6};
                disp_str(success_code);
            
            } else { // ²»Æ¥Åä
                // ÏÔÊ¾error
                printf("password not match!\n\r");
                // todo: edit code
                uint8_t error_code[] = {0xB6, 0xB6, 0x9E, 0x9C, 0x9C, 0x7C, 0xB6};
                disp_str(error_code);
            }
            
            /* ·µ»Ø´ý»ú×´Ì¬ */
            edit_mode = hashMark;
            UpdateState(STATE_WAIT);
        }
        /* ÐÞ¸ÄÃÜÂë×´Ì¬ */
        else if (state.currentState == STATE_EDIT) {
            rand_delay();
            if (IsStateValid(STATE_EDIT)) {
                state.errorCode = EXCEPT_UNVALIAD_STATE;
                UpdateState(STATE_EXCEPTION);
                continue;
            }

